Revit 2027 API
NumberingSchema.RemoveMatchingParameter Method
 Remove a parameter from the set of parameters used in matching elements so they would get the same number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveMatchingParameter(
	NumberingParameter numberingParameter
)
Public Sub RemoveMatchingParameter (
	numberingParameter As NumberingParameter
)
public:
void RemoveMatchingParameter(
	NumberingParameter^ numberingParameter
)
member RemoveMatchingParameter :
        numberingParameter : NumberingParameter -> unit
Parameters
numberingParameter NumberingParameter
 Parameter to remove from the matching criteria.
Exceptions
Exception | Condition
ArgumentException |  The input parameter is not valid for use in matching for numbering. -or- The schema does not have matching parameters
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace